server/src/test/resources/requestExample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://oshcherbak.com/soap/api">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getEntityRequest>
            <gs:id>2</gs:id>
        </gs:getEntityRequest>
    </soapenv:Body>
</soapenv:Envelope>